In [1]:
import pandas as pd

In [11]:
file_path = "../data/budownictwo_mieszkaniowe_w_okresie_styczen-pazdziernik_2024_r._tabela_2.xls" 
df = pd.read_excel(file_path, header=1)
df.head()

,Unnamed: 0,I,I-II,I-III,I-IV,I-V,I-VI,I-VII,I-VIII,I-IX,I-X,I-XI,I-XII
0,NaN,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,OGÓŁEM,8826,17065,24238,32824,41548,53343,63701,72319,82423,93135,105830,136790
2,indywidualne,2244,4172,6254,8323,10700,15096,17138,19410,22464,26134,30148,39958
3,sprzedaż lub wynajem,-,-,-,-,-,-,-,-,-,-,-,-
4,spółdzielcze,5525,10746,15323,21167,26773,33484,40763,46316,52550,58642,66157,83554

Możemy użyć metody `stepwise_selection` z pakietu _dmba_.

In [12]:
df['year'] = None
df.head()

,Unnamed: 0,I,I-II,I-III,I-IV,I-V,I-VI,I-VII,I-VIII,I-IX,I-X,I-XI,I-XII,year
0,NaN,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None
1,OGÓŁEM,8826,17065,24238,32824,41548,53343,63701,72319,82423,93135,105830,136790,None
2,indywidualne,2244,4172,6254,8323,10700,15096,17138,19410,22464,26134,30148,39958,None
3,sprzedaż lub wynajem,-,-,-,-,-,-,-,-,-,-,-,-,None
4,spółdzielcze,5525,10746,15323,21167,26773,33484,40763,46316,52550,58642,66157,83554,None

In [ ]:
current_year = None
for row in df.iterrows():